app/controllers/articles_controller.rb

  def create
    @article = Article.new
    @article.title = params[:title]
    @article.description = params[:description]
    @article.save
---
INSERT INTO "articles" ("title", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "My article title"], ["description", "My article description"], ["created_at", "2019-07-23 21:17:10.474268"], ["updated_at", "2019-07-23 21:17:10.474268"]]

  def edit
    @article = Article.find(params[:id])
---
SELECT  "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def update
    @article = Article.new
    @article.title = params[:title]
    @article.description = params[:description]
    @article.save
---
INSERT INTO "articles" ("created_at", "updated_at") VALUES (?, ?)  [["created_at", "2019-07-23 21:30:37.636225"], ["updated_at", "2019-07-23 21:30:37.636225"]]